#pragma once

constexpr wchar_t E_WRONG_ZONE[] = L"Неможливо змінити це доручення/стадію, оскільки вона належить до іншого центру";
constexpr wchar_t E_OLD_ORDER[] = L"Неможливо змінити це доручення, оскільки воно було додане більше року тому";
constexpr wchar_t E_OLD_STAGE[] = L"Неможливо змінити цю стадію, оскільки вона належить до минулого періоду";
constexpr wchar_t E_FINALIZED_STAGE[] = L"Неможливо змінити цю стадію, оскільки вона оплачена, а отже закрита";
constexpr wchar_t E_PAYMENTS_INSERT[] = L"Відсутні права на додавання нових доручень. Зверніться до адміністратора БД";